# SystemsAnalysisOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SystemsAnalysisOptions Class
Members See Also
---
Contains the options for systems analysis.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class SystemsAnalysisOptions : IDisposable
```

Visual Basic
---
```text
Public Class SystemsAnalysisOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SystemsAnalysisOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..SystemsAnalysisOptions
# See Also
SystemsAnalysisOptions Members
Autodesk.Revit.DB.Analysis Namespace